[
    {
        "identifier": "physicist",
        "aliases": ["physicists"],
        "ruleName": "The Physicist's Rule",
        "description": "As long as the shuttlecock (or other item) hits matter of any kind, it is considered \"in\".",
        "details": "This rule effectively means that the majority of shots are in, especially when playing on Earth (or other similar planets). This rule invalidates Version 2 of this rule."
    },
    {
        "identifier": "physicistv2",
        "aliases": ["physicist2", "physicists2", "physicistsv2"],
        "ruleName": "The Physicist's Rule Version 2",
        "description": "If the shuttlecock is touched by a photon, it is considered \"out\".",
        "details": "This rule effectively means that the majority of shots are out, especially when playing on Earth. This rule invalidates the original version of this rule."
    },
    {
        "identifier": "ghost",
        "aliases": [],
        "ruleName": "The Ghost Rule",
        "description": "If the shuttlecock passes through the net (perhaps through a large enough hole), should the person who performed this action gain points before hitting the shuttlecock again, the points gained are doubled.",
        "details": null
    },
    {
        "identifier": "benjeffery",
        "aliases": ["benj","irrelevantnet"],
        "ruleName": "The Ben Jeffery Rule",
        "description": "Invoking this almighty rule allows you to remove grates from doors. This rule makes the net irrelevant, and therefore should the shuttlecock pass under the net, it still counts as if it went over the net.",
        "details": "The name and description of this rule is an inside joke, so don't worry too much about it ;)"
    },
    {
        "identifier": "tippingpoint",
        "aliases": ["tipping"],
        "ruleName": "The Tipping Point Rule",
        "description": "You can play right up to (and touching) the net.",
        "details": "This rule is so named because you could literally tip the shuttlecock just over the net using this rule."
    }
]